In [37]:
import numpy as np
import pandas as pd
import os

In [10]:
my_index = ['USA', 'Canada', 'Mexico']
my_data = [1776, 1867, 1821]

In [12]:
my_series = pd.Series(data=my_data, index=my_index)
my_series

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [15]:
#labeled index
my_series['USA']

1776

In [16]:
#numeric index
my_series[0]

1776

In [19]:
ages = {'Sam': 5, 'Frank': 10, 'Spike': 7 }
pd.Series(ages)

Sam       5
Frank    10
Spike     7
dtype: int64

### Imaginary sales data

In [20]:
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100, 'China': 500, 'India': 210, 'USA': 260}

In [21]:
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [24]:
#to get the keys or index
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [28]:
# to combine series
total_sales = sales_q1.add(sales_q2, fill_value=0)
total_sales

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

### DATAFRAMES

In [29]:
np.random.seed(101)
my_data = np.random.randint(0,101,(4,3))

In [33]:
my_index = ['CA', 'NY', 'AZ', 'TX']
my_columns = ['Jan', 'Feb', 'Mar']

In [35]:
df = pd.DataFrame(data=my_data, index=my_index, columns=my_columns)
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [42]:
#get current file location
os.getcwd()

'/Users/chestergarettcalingacion/Documents/python_projects/ml_pathway'

In [44]:
# get all files of current directory
os.listdir()

['numpy_101.ipynb', 'pandas_101.ipynb', '.ipynb_checkpoints', '.git']

In [47]:
df = pd.read_csv(r'sample_files/tips.csv')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]